[{"postContent": ["\r\n\t\t\t\t\tHi Everyone,", "\nIm 39 years old, male and have had a mechanical aortic valve for over 5 years now and really have never watched what I eat.  I take 10mg of Coumadin a day and all is fine, i drink on the weekends, i play sports, i pretty much do everything.  Lately over the past 6 months i have put on about 20 extra pounds.  I saw a movie called Fat Sick and Nearly Dead and decided to go on a juicing reboot diet.", "\nI tried contacting my cardio doc quite a few times but got no response, i was going to ask his advice first but since i have a home monitor i figured i would monitor.", "\nAbout three days before the juicing fast of 15 days began i started juicing kale, celery, cucumbers etc.. every morning, 24oz, lunch i would also have a juice and dinner was pretty much normal, chicken, vegetables etc..", "\nWell the day came to start my actual juicing and I did, 2 days later i checked my INR and it sunk to 1.9, my cardio doc says to stay between 2.5 and 3.5, it typically is about 3.5-4.  I tolerate it being a little high alot better than I do being low.  I know both are dangerous but i had some TIA's when it got low when i was out of the hospital and it freaked me out bad.", "\nI want to be healthy and try to go vegan and stay away from processed foods and red meats but i feel like everything points to eating fresh green veggies (80%) and fruits (20%) or something similar.  I take 10mg of Coumadin daily and really think that is already a very high dose, many say dose based on your diet so if thats the case i would be taking 15-20mg a day which i think is extremely high and not healthy.", "\nCan anyone lead me in the right direction here, maybe a book, video etc.. i feel like im at the bottom of a well screaming up and no one can hear me.  I want to be healthy but not die trying if that makes sense?", "\nThanks,", "\nTommy\r\n\t\t\t\t"], "postId": ["post_message_533147"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI share your feelings about TIA's.  I take 70 to 75 milligrams of warfarin per week and test weekly using my XS. Your activity level is five times what mine is. ", "\nPossibly your Vit K intake has drastically increased in a short period of time.  What about carbohydrates, you haven't mentioned them.", "\nMaybe you could source a nutritionist at your local hospital for expert dietary advice.\r\n\t\t\t\t"], "postId": ["post_message_533203"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tYou are binging on Kale, which is the highest possible Vit K containing leafy green! Of COURSE your INR is going to drop. Spinach or cabbage or brussels sprouts have 1/2 to 1/3 as much K per serving, but if you've not been eating many greens in your diet, you are going to have to adjust your doseage.", "\nThere are plenty of vegetarians on warfarin.\r\n\t\t\t\t"], "postId": ["post_message_533204"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI was just following the juicing / reboot diet to a tee, i had no clue about how much vitamin K was in what, for all i know there is tons of vitamin K in a green apple... im learning though, i would love to hear what vegetarians eat for lunch/dinner on a daily basis and how much of a dosage of Coumadin they are on...", "\r\nThanks,", "\r\nTommy", "\r\n\t\t\t\t"], "postId": ["post_message_533209"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tIt's easy to lose weight on a drastic diet but almost impossible to keep it off.  You may want to try less drastic changes.  ", "\nUnless you are pretty savvy (I am not), any major change in diet, if you are on warfarin, should be done with your doctor or nurse practioner's assistance.  At least this is what they told me on discharge this February.  ", "\nIf your cardiologist won't respond, maybe you need a new one, or to see your primary care physician.\r\n\t\t\t\t"], "postId": ["post_message_533211"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tIt looked to me like you planned to DOUBLE your dosage of warfarin because you're getting more Vitamin K in you diet.  This large a change in dosage sounds pretty dangerous -- I'd perhaps increase it 10% or so, and re-test in a few days.  You can always add more warfarin.  DOUBLING your dose can bring you way above range - and put you at risk of hemorrhage.  I know TIAs can be pretty scary (I had one last April), but I sure wouldn't want to deal with major bleeding.", "\nThe suggestion to have a medical professional assist with monitoring and management is a good one.\r\n\t\t\t\t"], "postId": ["post_message_533245"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tHi", "\r\nif you don't mind I'm curious about this as a recent study provided a linkage to Age related Macular Degeneration and long term aspirin use.", "\r\nthe article did not mention specifics (and haven't attempted to seriously dig deeper yet) but it would be interesting to know what dose they were taking and what we may be taking.", "\r\nI'm supposedly meant to be taking 50mg daily, but unlike my warfarin am not as regular, so its probably 3 days a week of that.", "\r\nWould be interested to know if anyone is on higher doses or knows any more about that study", "\r\n:-)\r\n\t\t\t\t"], "postId": ["post_message_532887"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tInteresting...I hope that there is no causal relationship. I have been on a daily aspirin (325mg) for years on the advice of my doctors.\r\n\t\t\t\t"], "postId": ["post_message_532893"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\t325mg daily for me too.\r\n\t\t\t\t"], "postId": ["post_message_532894"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI took low dose 7mg aspirin for years for it's anti-platelet qualities until I related it to ringing in my years about two years ago.  An MD on TV this a.m. Mentioned  the study of age-related macular degeneration and aspirin.  I was diagnosed with it about a year ago.  It's very slight so I'm not aware of it.  I don't know if one is related to the other or not but am very glad I stopped aspirin when I did.  The MD mentioned the study might be flawed and referred to low dose taken daily or any sized dose taken more than three times a week is suspect.\r\n\t\t\t\t"], "postId": ["post_message_532895"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\t", "yes, I think that the study may have issues too. There is a more through one in the making at the moment, which may be published in the next few years", "\nmean time I'm surprised at the dose ranges already reported 7 ~ 325mg\r\n\t\t\t\t"], "postId": ["post_message_532908"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tChris, I've been on 81mg/daily for 6 years now, and I AM very regular with dosage.  My AVR Surgeon kept me on it after my recent surgery.", "\nHaven't had any issues; will look up that study, though.  Thanks!", "\nCheers,", "\nJim", "\nPS - Interesting; there are a TON of links online, all about 18hrs old.  ", "\nI liked this one:  ", "\n(just because it had a common-sense-sort of approach)", "\nFrom another article, inquiring about causality vs correlation:", "\r\n\t\t\t\t"], "postId": ["post_message_532913"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI have been taking 81 mg aspirin daily for about 8 or 10 years.  I only bump into big things in the dark - can't blame the aspirin for that.", "\r\nMy take on the current study is that while there may be some correlation between aspirin usage and macular degeneration, there is no cause-and-effect relationship shown at the present.  Means that they are both present in the same patients, but they haven't seen anything to prove that the aspirin causes the degeneration.", "\r\nI'll wait and see. . .\r\n\t\t\t\t"], "postId": ["post_message_532922"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI also take 81 mg enteric coated aspirin daily along with my coumadin. (aspirin-am, coumadin-pm).\r\n\t\t\t\t"], "postId": ["post_message_533085"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tEven if there was a causal relationship between macular degeneration and aspirin, what counts is the risk and benefit ratio. Aspirin is proven to especially reduce the arterial side of thrombosis. If one is affected by a cardiac disease the benefit of preventing a heart ischemia will be way higher then the risk of macular degeneration. As long as there are no potent alternatives this probably wont change. However, it might be appropriate to asses a preventive application of aspirin in a patient without proven cardiac disease carefully.\r\n\t\t\t\t"], "postId": ["post_message_533087"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tIts very early days and very small numers of patients that have been studied in a single centre.", "\nLet me explain.", "\nThe benefits of aspirin was demonstrated in a huge (nearly 20,000 patient study), conducted in a randomised, multi centre (over 400 hospitals) and in the event of am yopcardial infarction, mortality was shown to be reduced in those people who took aspirin by somewhere between 10 and 20%...a huge benefit, so much so that the resuklts were published in one of the most prestious, peer review journels, The Lancet.", "\nThe side eefct of macular degeneration has been detected in a study that looked ta just over 2,000 patients, and teh results should be look ed at with interest, but lots of caution.", "\nMy take is that the reduction isn risk of clots and heart atatcks and occlusive strokes by taking regular aspirin far outweigh the (so far) remote possibility of macular degeneration. I guess the message here is have regular health and eye checks, I know the last time I got my glasses from the optometrist, he checked for macular degeneration, and took a picture of my retina for future comparisons to monitor for the development of this condition.", "\nEarly days, small numbers, read with interest, but don't, whatever you do, stop taking aspirin without specific medical advice....in my humble opinion anyway.\r\n\t\t\t\t"], "postId": ["post_message_533093"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\t75mg daily for me", "\nSarah xxx\r\n\t\t\t\t"], "postId": ["post_message_533224"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tHi Sarah Louise,", "\n75 mgs daily, are you sure?\r\n\t\t\t\t"], "postId": ["post_message_533232"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\t", "Yup i'm sure lol ", "\ni take:", "\n75mgs asprin, ", "\n20,000 units of heparin over 2mls, ", "\n100mg of carvedilol (was told the other day that's twice the recommended dosage for the UK) ", "\n25mg lostartan, ", "\n30mg lanzoprazol, ", "\n40mg frusimide, ", "\n1g of metformin ", "\ndaily, excuse my spelling lol, ", "\nJW, why did you ask? ", "\nSarah xxx\r\n\t\t\t\t"], "postId": ["post_message_533514"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI'm sure that he asked because Aspirin - at least in the United States - is not available in 75 mg doses.  It's either 81 mg (which is about 1/4 of a standard dose) or 325 mg (a standard dose).  Unless you sliced a specific amount off of an 81 mg pill, you wouldn't be able to get a 75mg.  (I don't know if Aspirin from foreign sources may be available in different strengths) but I don't think you can even find 75 mg in North America.", "\nOf course, it looks like you're in the UK, so perhaps they offer 75 and 300 mg doses.  (Hey, if they can drive on the wrong side of the road, why couldn't they confuse things with a different aspirin dose, too?)\r\n\t\t\t\t"], "postId": ["post_message_533516"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tAfter my first two surgeries in 1975, my heart doctors advised me NEVER to take an aspirin.  It was like voodoo or taboo to ever take it.  The only meds I took for 25 years were coumadin and Lanoxin.   ", "\nThen after my 3rd OHS in 2006, the doctors sent me home with low dose aspirin (81mg) along with 16 other meds!   Many heart patients that I talk to today, say that they too take aspirin, usually in a low dose.\r\n\t\t\t\t"], "postId": ["post_message_533517"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI was started on a 81mg aspirin tablet daily right after surgery and I'm still taking it.  When I went to Germany last summer I forget to take my aspirin along and had to buy it there.  Interestingly enough the 81mg dose was not available, they use a 100mg as a therapeutic dose.\r\n\t\t\t\t"], "postId": ["post_message_533527"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI started taking 81mg, too, just to keep my platelets a bit more 'slippery.'  I've stopped, when I saw something associating continuous aspirin use with tinnitus (ringing in the ears).  I've been off the 81 mg aspirin for a few weeks, but haven't seen any change in the tinnitus. ", "\n(Also - some 'interns' who examined me a few months ago went bananas when I told them that I was taking 81 mg aspirin in addition to my warfarin.  Apparently, they had a few hours of discussion on anticoagulation, so they knew more than this 'iggurant' patient did)\r\n\t\t\t\t"], "postId": ["post_message_533529"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\t", "Aspirin and warfarin interaction is interesting, and the use of aspirin with warfarin for specific conditions has changed over time, with new evidence and further studies showing that in some instanes, for some indications, aspirin can indeed be taken safely with warfarin....but....BUT... it must be prescribed by your doctor who knows all about your warfaarin and condition being treated and they must know exactly what else you are taking and in what dosages. ", "\r\nRemember, people take warfarin for different conditions (temporarily fo tissue valve, long term for mechanical valves, sometime for pulmonary embolus or DVTs, sometimes for atrial fibrillation etc). Aspriin interacts with warfin protein binding and can increase the effect of warfarin and increase the risk of bleeding, but at prescribed doses and with INR checking etc, it can be very effective at preventing clots. The messgae is don't start taking aspirin or stop taking aspirin or change the dose of asprin without checking with your doctor. ", "\r\nIt doesn't surprise me that the interns were worried about a patient taking aspirin, because they had probably heard about the interaction of aspirin and warfarin in their pharamcology lessons, and perhaps hadn't been right up to date with current best practice. However, if you had started taking the aspirin without telling your doctor, or before surgery, or without having your INR checked, I would absolutely expect them to be concerned about your health...and I would think they would \"go bananas\", and apples and oranges "], "postId": ["post_message_533531"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tMy mother's pig valve isn't even 2 years old and is failing! she is already in the serious stage.  how often does this happen?  and why?  She's in her early 80's and the thought of going through surgery again is overwhelming.  She was told it would last much longer than this. Wish she could have minimally invasive surgery, but they (Mayo) tell her regular surgery is best.  has anyone else had a similar situation?\r\n\t\t\t\t"], "postId": ["post_message_508027"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tAt your mother's age, I'd have to suspect that there is something wrong with the valve itself.  The younger a person is when they get a tissue valve, the quicker they will need a replacement, however, even 2 years in a very young person is very unusual.  What brand valve does she have?  Which valve is it that needs to be replaced?  What did the Mayo say about the early failure?", "\r\nI'm so sorry for this news and I'm sure it is shocking.  They do valve surgery on patients this age more and more frequently with good results.  You have a very good medical team behind her.", "\r\nKim\r\n\t\t\t\t"], "postId": ["post_message_508035"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI can only imagine how heartsick your mother and your family is over this development. When she had her original replacement, she would have received a card stating the particulars of the valve and a way to communicate with the company. I would start with the company to find an answer. As Kim stated, it probably is a valve failure, and the manufacturer wants to know about it too.", "\r\nIt is a replacement for the aortic valve? Was the original replacement done at Mayo? I think you still have time to investigate options if the valve is still in the serious stage. If it were me, I would try to get a second opinion for what type of surgery can be done, and I would definitely want to know why this valve failed before I had another one put in.", "\r\nPlease keep us informed and let us help in any way we can.", "\r\nMary\r\n\t\t\t\t"], "postId": ["post_message_508041"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tThanks Kim and Mary for the posts.  Helps to hear from others.  ", "\r\nThe cardiologist said there was \"conflicting\" information on her last report and he was going to consult with others and get back to us.  But he did say it's possible they gave her a valve that was too small.  I feel really sick about this now, because I think we threw the paper work that came with the kind of valve she got or what company it was from.  Do you think her medical records would have this info.?  We are thinking of going to Allina in Mlps. for another opinion.  ", "\r\nOn top of this, my son who is only 15 also has the condition.  We just found out about 1 year ago about him.  (I was tested and don't have it.)  So now I'm thinking how many surgeries will he have to go through in his lifetime?  They tell us he'll need surgery within 10 years or sooner.  life is tough enough as a teenager without this on his mind too.  We aren't telling him about his grandma until we have to.\r\n\t\t\t\t"], "postId": ["post_message_508051"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tAnne,  I'm assuming that since your son has it too, it is her aortic valve?   How is her health otherwise?    If it is her aortic valve, one option to consider is percutaneous replacement of that valve, unless the one she has now is too small which may make that not possible.  The type of valve she received would most certainly be in her surgical notes.  Did she have her original surgery at the Mayo, if so, they typically send out copies of all those notes after each visit/hospital stay.  Others on here are more knowledgeable than me on this, but I didn't realize that a valve being too small could cause it to fail early, I just thought it could cause other issues.", "\nAs for your son, there really is no telling when he will need surgery, and depending on his age at the time, it may be best to consider a mechanical valve for him so he doesn't have to go through numerous surgeries in his lifetime.", "\nKim\r\n\t\t\t\t"], "postId": ["post_message_508061"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tAnne, ", "\r\nI have a bicuspid aortic valve, bav, one son has it, and a grandson (age 2) also has it. Is this the condition you are referring to? If so, your mother actually made it many years without needing replacement, so it's possible that your son will too.", "\r\nIs it possible the paperwork you threw away was in regards to something else other than her valve? The valve company sends a card with the information on it and mentions that the card should be carried with the valve recipient at all times. Usually it's not something that one would think was unimportant and pitch. Her cardiologist should also have the valve information. Usually when they run an echocardiogram post-replacement, they want the valve information because the echo's software program needs the information to calculate results.\r\n\t\t\t\t"], "postId": ["post_message_508070"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\t", "Yes, they both have BAV stenosis.  it was her aortic valve that they replaced.  Dr. said it's best to wait until she has symptoms again.  she takes BP, chloresteral and thryroid meds.  Drs. gave her a 98% successful surgery rate last time and luckily, surgery went as it should have & no complications.  What is \"percutaneous replacement?\"\r\n\t\t\t\t"], "postId": ["post_message_508071"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\t", "Find a discussion of percutaneous replacement here:", "\r\n\t\t\t\t"], "postId": ["post_message_508074"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI had my surgery just over 2 years ago and must say I would be devastated if I should now learn that, for whatever reason, the valve is up to no good. Tissue valves, both porcine and bovine, are supposed to last much, much longer in us older people, so the 2 years is just so upsetting. You should really try to obtain the particulars of the valve, make, model and serial number. If I were your mother I would definitely alert the manufacturers of the valve. In fact I would strongly insist that my cardiologist and surgeon also involve themselves. Johan\r\n\t\t\t\t"], "postId": ["post_message_508159"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tAnne - So sorry to hear this is happening.  Pig valve failure in 2 years at the age of your mother is not impossible, but extremely rare, as the others posted.  Based on your follow-up comments, I'm wondering if maybe it may be more directly related to the valve size issue, possibly something called \"patient prosthetic mismatch\".  All prosthetic valves reduce the effective opening area of a patient's native valve to a degree, depending on the type of valve used.  In most circumstances, this is not an issue, but for patients with an already small native valve, it can lead to problems.  Let me just say I'm only guessing here, I could be completely off track.  But a common factor for this \"mismatch\" issue are patients who have small aortic roots, seen most frequently in the elderly, particularly women.  The surgery to avoid this potential problem and allow a larger size valve to be implanted involves enlarging the aortic root , which is more complicated and higher risk, not often the first choice procedure.  Again, please forgive me for speculating, but just wanted to mention one possible scenario that could explain valve \"failure\" as it relates to size.", "\r\nThe percutaneous replacement method mentioned, done through a catheter and not open-heart, was FDA approved only in the last month or so.  It's an amazing breakthrough, but unfortunately is only for patients who meet certain criteria.  Most critically, it is only for those who are deemed otherwise inoperable.", "\r\nBest wishes to you and your mother in trying to learn more about this situation, and finding the best possible plan moving forward.\r\n\t\t\t\t"], "postId": ["post_message_508188"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tThanks again for everyone's well wishes and comments.  I appreciate the support!  The doctor left us that day, last Thurs., telling us he would look at echo himself and consult with collegues.  Now today is late Tues....no call back yet, as he said he would.  I will call him tomorrow.  She says she won't go through another OHS, feels she wouldn't survive it at her age.  I think we will try to go to another Dr. before Christmas, regardless of what this cardiologist says when he calls (if he calls.)\r\n\t\t\t\t"], "postId": ["post_message_508235"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tAn update...Card. told her Nov 23 that he and his collegues could not figure out the conflicting info. on her echo and that  he is sending it to a specialist at Mayo, Rochester and he would call us when they know more.  That's been 2 weeks ago!  No news is good news??  Part of me thinks, good, can't be too bad then....but I know I better call and find out what's going on.  In the meantime, she will see another Dr. next week to get a referral to get another opinion.\r\n\t\t\t\t"], "postId": ["post_message_509217"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tHi Anne,", "\r\nI like the premise of no news being good news. To put my mind at ease, I would be putting in a call to the office to confirm this. Glad you are getting another referral. ", "\r\nOther than an echo, has she had a TEE or angiogram to confirm the diagnosis? I would want another type of test to confirm the echo (which isn't always reliable). ", "\r\nAll the best,\r\n\t\t\t\t"], "postId": ["post_message_509218"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tDitto to ottagal.  I'd get that call placed as soon as possible; this can be a difficult time of year to get things done.  And more expert opinions probably can't hurt.  Occasionally a member here reports a frightening echo report which later gets clarified as a harmless \"shadow\" or something.  I hope you and your mother get much better news.  Best wishes "], "postId": ["post_message_509225"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tAnn, I am truly sorry your mother has to go through this!    My first thought would be that there was something wrong with the valve itself, or maybe a mis-match??   Tissue valves ordinarily last much long, especially in the elderly.\r\n\t\t\t\t"], "postId": ["post_message_509327"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tSorry to hear your mother's predicament. I hope the consult with another doctor will help clarify the situation.", "\nJust to echo what others have said, me stepson had an echo that came back with rather frightening results about 3 years ago. Then he had a catheter procedure done and the results came back in the \"normal\" range. Getting a more specific and predictable test done is definitely an option. I'm surprised that the doctors haven't discussed that with you and her.\r\n\t\t\t\t"], "postId": ["post_message_509381"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tGood luck, keep us posted, and ditto to what everybody else has said.\r\n\t\t\t\t"], "postId": ["post_message_509382"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tDid she have a mosaic valve by any chance? Lots of early failures (incluing 4 years for me) from what people have said on this site. My surgeon said it was something to do with what it was coated in. However, there are many people with this valve who have no problems.", "\nOther issues for early failure are kidney problems and potentially high blood pressure. ", "\nI didn't think they could do catheter ops with porcine valves but I could be wrong. It could be done minimal invasive if there isn't too much scar tissue.", "\nIf she does have the op again it may be worth getting a mechanical valve. Although rare at an older age it would be a risk to get another tissue valve if it were to fail again (unless there is an obvious cause)", "\nJust go let you know that reops are not generally more risky than first ops although I know your mums age is also a risk factor for a 2nd reop. This is definitely something that should be sorted out ASAP. The fitter a person is that goes into surgery the better the outcome, no matter what age. ", "\nGood luck.\r\n\t\t\t\t"], "postId": ["post_message_509532"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tIt sounds like they're concerned that there's a patient-prosthesis mismatch, which is when they put in the wrong size valve (usually too small, although too large can cause just as much trouble).  Other than that, it would have to be an actual failure of the valve structure.  She didn't calcify it in two years.  Too small, it causes instant stenosis.  Too large, the leaflets of the valve rub and get caught and damaged by the surrounding structure. ", "\nThe thing I'm wondering about is why they haven't redone the echocardiogram with a different tech and different machine (unless they have and I missed it).  Conflicting results and no symptoms should be waving red flags.", "\nPercutaneous replacement is so much less demanding than the full surgery.  If I were her, I would want to go with that.  As far as I'm aware, all of the percutaneously-replaced valves are xenografts (biological valves).  In this situation (depending on what that turns out to be), the only good thing about the current valve being biological is that it allows replacement with a percutaneous valve.  If it were a mechanical valve, it would require the reoperation.", "\nBest wishes,\r\n\t\t\t\t"], "postId": ["post_message_509546"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI have a mosaic porcine heart valve. My surgery will be 4 years old in January. After 6 mts my valve was failing. I saw another surgeon in Houston and he agreed that it was failing but thought I would get another 3 years out of it and would be replaced with a mechanical valve. I had an echo done two weeks ago and there is no further change in the valve. It's the same today as it was six months after I had surgery. No one could tell me why, just one of those things however when it's you it's not just one of those things. I am 70 now and certainly am not looking forward to another surgery but maybe I'll continue to beat the odds and I do  hope your Mother does as well. As everyone else said follow up, get another opinion.\r\n\t\t\t\t"], "postId": ["post_message_509623"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tI'm sorry to hear about your mom, Hopefully they can help her without needing surgery. FWIW I wouldn't get my hopes too high she would be a candidate for Percutaneous replacement (TAVI) IF the problem is her current valve is too small. Since they place the valve inside the current valve the TAVI valve is slightly smaller than the valve it is placed in side, so it sounds like she would need a larger valve then they put in her last time. Also they dont make TAVI valves that fit inside the small Aortic valves yet.. ", "\r\nI definately would ask about it, incase it is an option or there is another reason it needs replaced beside they used too small a valve the first surgery.\r\n\t\t\t\t"], "postId": ["post_message_509627"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tWow...I had no idea so many of you responded since the last time I updated this post!  THANK YOU!  It's very comforting....", "\r\nI think the day after my last post, she got the call.  I also called the cardio. and had him repeat to me.  It was a patient mis-match that caused this.  Her \"gradient\" level went form 16 to 28 to 40 to 44 (every 6 months) since the surgery 2 years ago...he says the \"good news\" is that the 40 to 44 isn't too much change over the last 6 months and hopefully it will continue to not increase much.  We went to another clinic last week, that Dr. (family physician) look at the last echo results and report and was equally surprised by it.  He apologized to her for this on \"behalf of all physicians\" for this mistake.  She will have another echo at this new clinic in Jan and then see a new cardio. for another opinion.  The new family physician agreed to postpone another surgery for as long as possible, but she refuses to have another OH surgery anyway.  no one has suggested any other type of test as of yet. ", "\r\nOn another note...my 16 yr. old had a gradient of 30 a year ago...he will see cardio. in Jan. also....just alot to deal with at this time of year.\r\n\t\t\t\t"], "postId": ["post_message_509700"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tSo sorry to hear about this, can't imagine what your mother, yourself and family are going through.", "\nI do have a question and if you don't feel like answering no hard feelings, But was this the Mayo Clinic in Rochester? and if so what was the surgeons name?\r\n\t\t\t\t"], "postId": ["post_message_510504"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tMom had her 2nd opionion.  He says she's at a gradiant of 44. He's confused by the report also...he has ordered the actual video of the last echo to review and compare to the next echo. She will have another echo in March (that will be 6 mo. since the last one)  Pray for her.  Had to place Dad in a home recently and his health is failing on top of all this.  very stressful time.  My son had his annual checkup and was told his is at gradiant of 40.  I don't understand these gradiant numbers....we were told 44 is severe, yet my son went from a 30 to 40 in one year & won't need surgery for hopefully 10 years yet (we were told).  How bad does your number need to be to have surgery?  or do they just go by if you have symptoms?\r\n\t\t\t\t"], "postId": ["post_message_513572"], "description": "shnur"},
{"postContent": ["\r\n\t\t\t\t\tUsually they go by a combination of both. If the numbers are bad enough with no symptoms they may recommend surgery with no symptoms. If the numbers aren't bad but symptoms say otherwise they will do surgery.\r\n\t\t\t\t"], "postId": ["post_message_513587"], "description": "shnur"}]